{"metadata":{"key":"module_info_Perl::Critic","timestamp":"2025-07-12T17:58:19.296628181Z","expires":"2025-07-13T17:58:19.296628181Z","source":"metacpan","cache_control":"private","content_hash":"e45132156e51e9fbc0594b5f46fcba077fecd10bc48074488cd50485a4b3ece7","url":"https://api.metacpan.org/v1/module/Perl%3A%3ACritic"},"data":{"Name":"Perl::Critic","Version":"1.156","Author":"PETDANCE","AuthorName":"","Description":"Perl::Critic is an extensible framework for creating and applying coding standards to Perl source code. Essentially, it is a static source code analysis engine. Perl::Critic is distributed with a number of Perl::Critic::Policy modules that attempt to enforce various coding guidelines. Most Policy modules are based on Damian Conway's book Perl Best Practices. However, Perl::Critic is not limited to PBP and will even support Policies that contradict Conway. You can enable, disable, and customize those Polices through the Perl::Critic interface. You can also create new Policy modules that suit your own tastes. For a command-line interface to Perl::Critic, see the documentation for perlcritic. If you want to integrate Perl::Critic with your build process, Test::Perl::Critic provides an interface that is suitable for test programs. Also, Test::Perl::Critic::Progressive is useful for gradually applying coding standards to legacy code. For the ultimate convenience (at the expense of some flexibility) see the criticism pragma. If you'd like to try Perl::Critic without installing anything, there is a web-service available at \u003chttp://perlcritic.com\u003e. The web-service does not yet support all the configuration features that are available in the native Perl::Critic API, but it should give you a good idea of what it does. Also, ActivePerl includes a very slick graphical interface to Perl-Critic called \"perlcritic-gui\". You can get a free community edition of ActivePerl from \u003chttp://www.activestate.com\u003e.","Abstract":"Critique Perl source code for best-practices.","Distribution":"Perl-Critic","DistributionVersion":"1.156","DistributionFile":"https://cpan.metacpan.org/authors/id/P/PE/PETDANCE/Perl-Critic-1.156.tar.gz","ReleaseDate":"0001-01-01T00:00:00Z","Repository":"","Homepage":"","Bugtracker":"","License":"","Dependencies":null,"Documentation":"https://metacpan.org/pod/Perl::Critic","Rating":0,"Downloads":0,"IsCore":false,"HasTests":false,"Path":""}}